; domain
(define (domain emergencia)
  (:requirements :strips :typing)

  (:types
    location
    person
    crate
    content
    drone
  )

  (:predicates
    (at-drone ?d - drone ?l - location)
    (at-person ?p - person ?l - location)
    (at-crate ?c - crate ?l - location)

    (has-content ?c - crate ?con - content)
    (has ?p - person ?con - content)

    (free-arm1 ?d - drone)
    (free-arm2 ?d - drone)

    (carrying-arm1 ?d - drone ?c - crate)
    (carrying-arm2 ?d - drone ?c - crate)

    (available ?c - crate)
  )

  (:action fly
    :parameters (?d - drone ?from - location ?to - location)
    :precondition
      (at-drone ?d ?from)
    :effect
      (and
        (not (at-drone ?d ?from))
        (at-drone ?d ?to)
      )
  )

  (:action pickup-arm1
    :parameters (?d - drone ?c - crate ?l - location)
    :precondition
      (and
        (at-drone ?d ?l)
        (at-crate ?c ?l)
        (free-arm1 ?d)
        (available ?c)
      )
    :effect
      (and
        (not (at-crate ?c ?l))
        (not (free-arm1 ?d))
        (not (available ?c))
        (carrying-arm1 ?d ?c)
      )
  )

  (:action pickup-arm2
    :parameters (?d - drone ?c - crate ?l - location)
    :precondition
      (and
        (at-drone ?d ?l)
        (at-crate ?c ?l)
        (free-arm2 ?d)
        (available ?c)
      )
    :effect
      (and
        (not (at-crate ?c ?l))
        (not (free-arm2 ?d))
        (not (available ?c))
        (carrying-arm2 ?d ?c)
      )
  )

  (:action deliver-arm1
    :parameters (?d - drone ?c - crate ?p - person ?con - content ?l - location)
    :precondition
      (and
        (at-drone ?d ?l)
        (at-person ?p ?l)
        (carrying-arm1 ?d ?c)
        (has-content ?c ?con)
      )
    :effect
      (and
        (not (carrying-arm1 ?d ?c))
        (free-arm1 ?d)
        (has ?p ?con)
      )
  )

  (:action deliver-arm2
    :parameters (?d - drone ?c - crate ?p - person ?con - content ?l - location)
    :precondition
      (and
        (at-drone ?d ?l)
        (at-person ?p ?l)
        (carrying-arm2 ?d ?c)
        (has-content ?c ?con)
      )
    :effect
      (and
        (not (carrying-arm2 ?d ?c))
        (free-arm2 ?d)
        (has ?p ?con)
      )
  )
)

; problem
(define (problem drone_problem_d1_r0_l35_p35_c35_g35_ct2)
(:domain emergencia)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	loc24 - location
	loc25 - location
	loc26 - location
	loc27 - location
	loc28 - location
	loc29 - location
	loc30 - location
	loc31 - location
	loc32 - location
	loc33 - location
	loc34 - location
	loc35 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	crate24 - crate
	crate25 - crate
	crate26 - crate
	crate27 - crate
	crate28 - crate
	crate29 - crate
	crate30 - crate
	crate31 - crate
	crate32 - crate
	crate33 - crate
	crate34 - crate
	crate35 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	person26 - person
	person27 - person
	person28 - person
	person29 - person
	person30 - person
	person31 - person
	person32 - person
	person33 - person
	person34 - person
	person35 - person
)
(:init
	(at-drone drone1 depot)
	(free-arm1 drone1)
	(free-arm2 drone1)
	(at-crate crate1 depot)
	(available crate1)
	(at-crate crate2 depot)
	(available crate2)
	(at-crate crate3 depot)
	(available crate3)
	(at-crate crate4 depot)
	(available crate4)
	(at-crate crate5 depot)
	(available crate5)
	(at-crate crate6 depot)
	(available crate6)
	(at-crate crate7 depot)
	(available crate7)
	(at-crate crate8 depot)
	(available crate8)
	(at-crate crate9 depot)
	(available crate9)
	(at-crate crate10 depot)
	(available crate10)
	(at-crate crate11 depot)
	(available crate11)
	(at-crate crate12 depot)
	(available crate12)
	(at-crate crate13 depot)
	(available crate13)
	(at-crate crate14 depot)
	(available crate14)
	(at-crate crate15 depot)
	(available crate15)
	(at-crate crate16 depot)
	(available crate16)
	(at-crate crate17 depot)
	(available crate17)
	(at-crate crate18 depot)
	(available crate18)
	(at-crate crate19 depot)
	(available crate19)
	(at-crate crate20 depot)
	(available crate20)
	(at-crate crate21 depot)
	(available crate21)
	(at-crate crate22 depot)
	(available crate22)
	(at-crate crate23 depot)
	(available crate23)
	(at-crate crate24 depot)
	(available crate24)
	(at-crate crate25 depot)
	(available crate25)
	(at-crate crate26 depot)
	(available crate26)
	(at-crate crate27 depot)
	(available crate27)
	(at-crate crate28 depot)
	(available crate28)
	(at-crate crate29 depot)
	(available crate29)
	(at-crate crate30 depot)
	(available crate30)
	(at-crate crate31 depot)
	(available crate31)
	(at-crate crate32 depot)
	(available crate32)
	(at-crate crate33 depot)
	(available crate33)
	(at-crate crate34 depot)
	(available crate34)
	(at-crate crate35 depot)
	(available crate35)
	(has-content crate1 food)
	(has-content crate2 food)
	(has-content crate3 food)
	(has-content crate4 food)
	(has-content crate5 food)
	(has-content crate6 food)
	(has-content crate7 food)
	(has-content crate8 food)
	(has-content crate9 food)
	(has-content crate10 food)
	(has-content crate11 food)
	(has-content crate12 food)
	(has-content crate13 food)
	(has-content crate14 food)
	(has-content crate15 food)
	(has-content crate16 food)
	(has-content crate17 food)
	(has-content crate18 food)
	(has-content crate19 food)
	(has-content crate20 food)
	(has-content crate21 food)
	(has-content crate22 food)
	(has-content crate23 food)
	(has-content crate24 food)
	(has-content crate25 food)
	(has-content crate26 medicine)
	(has-content crate27 medicine)
	(has-content crate28 medicine)
	(has-content crate29 medicine)
	(has-content crate30 medicine)
	(has-content crate31 medicine)
	(has-content crate32 medicine)
	(has-content crate33 medicine)
	(has-content crate34 medicine)
	(has-content crate35 medicine)
	(at-person person1 loc11)
	(at-person person2 loc29)
	(at-person person3 loc5)
	(at-person person4 loc17)
	(at-person person5 loc11)
	(at-person person6 loc29)
	(at-person person7 loc34)
	(at-person person8 loc32)
	(at-person person9 loc1)
	(at-person person10 loc3)
	(at-person person11 loc32)
	(at-person person12 loc21)
	(at-person person13 loc20)
	(at-person person14 loc30)
	(at-person person15 loc4)
	(at-person person16 loc27)
	(at-person person17 loc13)
	(at-person person18 loc6)
	(at-person person19 loc9)
	(at-person person20 loc1)
	(at-person person21 loc26)
	(at-person person22 loc27)
	(at-person person23 loc21)
	(at-person person24 loc1)
	(at-person person25 loc14)
	(at-person person26 loc1)
	(at-person person27 loc1)
	(at-person person28 loc34)
	(at-person person29 loc7)
	(at-person person30 loc13)
	(at-person person31 loc8)
	(at-person person32 loc13)
	(at-person person33 loc20)
	(at-person person34 loc18)
	(at-person person35 loc12)
)
(:goal (and
	(at-drone drone1 depot)
	(has person2 food)
	(has person3 food)
	(has person3 medicine)
	(has person5 food)
	(has person6 food)
	(has person6 medicine)
	(has person7 food)
	(has person7 medicine)
	(has person8 medicine)
	(has person9 food)
	(has person10 food)
	(has person11 food)
	(has person12 food)
	(has person13 food)
	(has person14 food)
	(has person14 medicine)
	(has person15 food)
	(has person16 food)
	(has person17 food)
	(has person18 food)
	(has person18 medicine)
	(has person19 food)
	(has person19 medicine)
	(has person21 food)
	(has person22 food)
	(has person24 food)
	(has person26 food)
	(has person27 food)
	(has person28 food)
	(has person31 food)
	(has person32 medicine)
	(has person33 medicine)
	(has person34 food)
	(has person34 medicine)
	(has person35 food)
	))
)

; plan
1. (pickup-arm2 drone1 crate35 depot)
   deleted: (at-crate crate35 depot) (free-arm2 drone1) (available crate35)
   added: (carrying-arm2 drone1 crate35)
   goals met: 1 of 36
2. (pickup-arm1 drone1 crate25 depot)
   deleted: (at-crate crate25 depot) (free-arm1 drone1) (available crate25)
   added: (carrying-arm1 drone1 crate25)
   goals met: 1 of 36
3. (fly drone1 depot loc26)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc26)
   goals met: 0 of 36
4. (deliver-arm1 drone1 crate25 person21 food loc26)
   deleted: (carrying-arm1 drone1 crate25)
   added: (free-arm1 drone1) (has person21 food)
   goals met: 1 of 36
5. (fly drone1 loc26 depot)
   deleted: (at-drone drone1 loc26)
   added: (at-drone drone1 depot)
   goals met: 2 of 36
6. (pickup-arm1 drone1 crate24 depot)
   deleted: (at-crate crate24 depot) (free-arm1 drone1) (available crate24)
   added: (carrying-arm1 drone1 crate24)
   goals met: 2 of 36
7. (fly drone1 depot loc21)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc21)
   goals met: 1 of 36
8. (deliver-arm1 drone1 crate24 person12 food loc21)
   deleted: (carrying-arm1 drone1 crate24)
   added: (free-arm1 drone1) (has person12 food)
   goals met: 2 of 36
9. (fly drone1 loc21 depot)
   deleted: (at-drone drone1 loc21)
   added: (at-drone drone1 depot)
   goals met: 3 of 36
10. (pickup-arm1 drone1 crate23 depot)
   deleted: (at-crate crate23 depot) (free-arm1 drone1) (available crate23)
   added: (carrying-arm1 drone1 crate23)
   goals met: 3 of 36
11. (fly drone1 depot loc12)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc12)
   goals met: 2 of 36
12. (deliver-arm1 drone1 crate23 person35 food loc12)
   deleted: (carrying-arm1 drone1 crate23)
   added: (free-arm1 drone1) (has person35 food)
   goals met: 3 of 36
13. (fly drone1 loc12 depot)
   deleted: (at-drone drone1 loc12)
   added: (at-drone drone1 depot)
   goals met: 4 of 36
14. (pickup-arm1 drone1 crate22 depot)
   deleted: (at-crate crate22 depot) (free-arm1 drone1) (available crate22)
   added: (carrying-arm1 drone1 crate22)
   goals met: 4 of 36
15. (fly drone1 depot loc11)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc11)
   goals met: 3 of 36
16. (deliver-arm1 drone1 crate22 person5 food loc11)
   deleted: (carrying-arm1 drone1 crate22)
   added: (free-arm1 drone1) (has person5 food)
   goals met: 4 of 36
17. (fly drone1 loc11 depot)
   deleted: (at-drone drone1 loc11)
   added: (at-drone drone1 depot)
   goals met: 5 of 36
18. (pickup-arm1 drone1 crate21 depot)
   deleted: (at-crate crate21 depot) (free-arm1 drone1) (available crate21)
   added: (carrying-arm1 drone1 crate21)
   goals met: 5 of 36
19. (fly drone1 depot loc8)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc8)
   goals met: 4 of 36
20. (deliver-arm1 drone1 crate21 person31 food loc8)
   deleted: (carrying-arm1 drone1 crate21)
   added: (free-arm1 drone1) (has person31 food)
   goals met: 5 of 36
21. (fly drone1 loc8 depot)
   deleted: (at-drone drone1 loc8)
   added: (at-drone drone1 depot)
   goals met: 6 of 36
22. (pickup-arm1 drone1 crate20 depot)
   deleted: (at-crate crate20 depot) (free-arm1 drone1) (available crate20)
   added: (carrying-arm1 drone1 crate20)
   goals met: 6 of 36
23. (fly drone1 depot loc4)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc4)
   goals met: 5 of 36
24. (deliver-arm1 drone1 crate20 person15 food loc4)
   deleted: (carrying-arm1 drone1 crate20)
   added: (free-arm1 drone1) (has person15 food)
   goals met: 6 of 36
25. (fly drone1 loc4 depot)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 depot)
   goals met: 7 of 36
26. (pickup-arm1 drone1 crate19 depot)
   deleted: (at-crate crate19 depot) (free-arm1 drone1) (available crate19)
   added: (carrying-arm1 drone1 crate19)
   goals met: 7 of 36
27. (fly drone1 depot loc3)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc3)
   goals met: 6 of 36
28. (deliver-arm1 drone1 crate19 person10 food loc3)
   deleted: (carrying-arm1 drone1 crate19)
   added: (free-arm1 drone1) (has person10 food)
   goals met: 7 of 36
29. (fly drone1 loc3 depot)
   deleted: (at-drone drone1 loc3)
   added: (at-drone drone1 depot)
   goals met: 8 of 36
30. (pickup-arm1 drone1 crate18 depot)
   deleted: (at-crate crate18 depot) (free-arm1 drone1) (available crate18)
   added: (carrying-arm1 drone1 crate18)
   goals met: 8 of 36
31. (fly drone1 depot loc34)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc34)
   goals met: 7 of 36
32. (deliver-arm2 drone1 crate35 person7 medicine loc34)
   deleted: (carrying-arm2 drone1 crate35)
   added: (free-arm2 drone1) (has person7 medicine)
   goals met: 8 of 36
33. (fly drone1 loc34 depot)
   deleted: (at-drone drone1 loc34)
   added: (at-drone drone1 depot)
   goals met: 9 of 36
34. (pickup-arm2 drone1 crate34 depot)
   deleted: (at-crate crate34 depot) (free-arm2 drone1) (available crate34)
   added: (carrying-arm2 drone1 crate34)
   goals met: 9 of 36
35. (fly drone1 depot loc34)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc34)
   goals met: 8 of 36
36. (deliver-arm1 drone1 crate18 person7 food loc34)
   deleted: (carrying-arm1 drone1 crate18)
   added: (free-arm1 drone1) (has person7 food)
   goals met: 9 of 36
37. (fly drone1 loc34 depot)
   deleted: (at-drone drone1 loc34)
   added: (at-drone drone1 depot)
   goals met: 10 of 36
38. (pickup-arm1 drone1 crate17 depot)
   deleted: (at-crate crate17 depot) (free-arm1 drone1) (available crate17)
   added: (carrying-arm1 drone1 crate17)
   goals met: 10 of 36
39. (fly drone1 depot loc34)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc34)
   goals met: 9 of 36
40. (deliver-arm1 drone1 crate17 person28 food loc34)
   deleted: (carrying-arm1 drone1 crate17)
   added: (free-arm1 drone1) (has person28 food)
   goals met: 10 of 36
41. (fly drone1 loc34 depot)
   deleted: (at-drone drone1 loc34)
   added: (at-drone drone1 depot)
   goals met: 11 of 36
42. (pickup-arm1 drone1 crate16 depot)
   deleted: (at-crate crate16 depot) (free-arm1 drone1) (available crate16)
   added: (carrying-arm1 drone1 crate16)
   goals met: 11 of 36
43. (fly drone1 depot loc32)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc32)
   goals met: 10 of 36
44. (deliver-arm2 drone1 crate34 person8 medicine loc32)
   deleted: (carrying-arm2 drone1 crate34)
   added: (free-arm2 drone1) (has person8 medicine)
   goals met: 11 of 36
45. (deliver-arm1 drone1 crate16 person11 food loc32)
   deleted: (carrying-arm1 drone1 crate16)
   added: (free-arm1 drone1) (has person11 food)
   goals met: 12 of 36
46. (fly drone1 loc32 depot)
   deleted: (at-drone drone1 loc32)
   added: (at-drone drone1 depot)
   goals met: 13 of 36
47. (pickup-arm2 drone1 crate33 depot)
   deleted: (at-crate crate33 depot) (free-arm2 drone1) (available crate33)
   added: (carrying-arm2 drone1 crate33)
   goals met: 13 of 36
48. (pickup-arm1 drone1 crate15 depot)
   deleted: (at-crate crate15 depot) (free-arm1 drone1) (available crate15)
   added: (carrying-arm1 drone1 crate15)
   goals met: 13 of 36
49. (fly drone1 depot loc30)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc30)
   goals met: 12 of 36
50. (deliver-arm2 drone1 crate33 person14 medicine loc30)
   deleted: (carrying-arm2 drone1 crate33)
   added: (free-arm2 drone1) (has person14 medicine)
   goals met: 13 of 36
51. (deliver-arm1 drone1 crate15 person14 food loc30)
   deleted: (carrying-arm1 drone1 crate15)
   added: (free-arm1 drone1) (has person14 food)
   goals met: 14 of 36
52. (fly drone1 loc30 depot)
   deleted: (at-drone drone1 loc30)
   added: (at-drone drone1 depot)
   goals met: 15 of 36
53. (pickup-arm2 drone1 crate32 depot)
   deleted: (at-crate crate32 depot) (free-arm2 drone1) (available crate32)
   added: (carrying-arm2 drone1 crate32)
   goals met: 15 of 36
54. (pickup-arm1 drone1 crate14 depot)
   deleted: (at-crate crate14 depot) (free-arm1 drone1) (available crate14)
   added: (carrying-arm1 drone1 crate14)
   goals met: 15 of 36
55. (fly drone1 depot loc29)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc29)
   goals met: 14 of 36
56. (deliver-arm2 drone1 crate32 person6 medicine loc29)
   deleted: (carrying-arm2 drone1 crate32)
   added: (free-arm2 drone1) (has person6 medicine)
   goals met: 15 of 36
57. (fly drone1 loc29 depot)
   deleted: (at-drone drone1 loc29)
   added: (at-drone drone1 depot)
   goals met: 16 of 36
58. (pickup-arm2 drone1 crate31 depot)
   deleted: (at-crate crate31 depot) (free-arm2 drone1) (available crate31)
   added: (carrying-arm2 drone1 crate31)
   goals met: 16 of 36
59. (fly drone1 depot loc29)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc29)
   goals met: 15 of 36
60. (deliver-arm1 drone1 crate14 person2 food loc29)
   deleted: (carrying-arm1 drone1 crate14)
   added: (free-arm1 drone1) (has person2 food)
   goals met: 16 of 36
61. (fly drone1 loc29 depot)
   deleted: (at-drone drone1 loc29)
   added: (at-drone drone1 depot)
   goals met: 17 of 36
62. (pickup-arm1 drone1 crate13 depot)
   deleted: (at-crate crate13 depot) (free-arm1 drone1) (available crate13)
   added: (carrying-arm1 drone1 crate13)
   goals met: 17 of 36
63. (fly drone1 depot loc29)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc29)
   goals met: 16 of 36
64. (deliver-arm1 drone1 crate13 person6 food loc29)
   deleted: (carrying-arm1 drone1 crate13)
   added: (free-arm1 drone1) (has person6 food)
   goals met: 17 of 36
65. (fly drone1 loc29 depot)
   deleted: (at-drone drone1 loc29)
   added: (at-drone drone1 depot)
   goals met: 18 of 36
66. (pickup-arm1 drone1 crate12 depot)
   deleted: (at-crate crate12 depot) (free-arm1 drone1) (available crate12)
   added: (carrying-arm1 drone1 crate12)
   goals met: 18 of 36
67. (fly drone1 depot loc27)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc27)
   goals met: 17 of 36
68. (deliver-arm1 drone1 crate12 person16 food loc27)
   deleted: (carrying-arm1 drone1 crate12)
   added: (free-arm1 drone1) (has person16 food)
   goals met: 18 of 36
69. (fly drone1 loc27 depot)
   deleted: (at-drone drone1 loc27)
   added: (at-drone drone1 depot)
   goals met: 19 of 36
70. (pickup-arm1 drone1 crate11 depot)
   deleted: (at-crate crate11 depot) (free-arm1 drone1) (available crate11)
   added: (carrying-arm1 drone1 crate11)
   goals met: 19 of 36
71. (fly drone1 depot loc27)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc27)
   goals met: 18 of 36
72. (deliver-arm1 drone1 crate11 person22 food loc27)
   deleted: (carrying-arm1 drone1 crate11)
   added: (free-arm1 drone1) (has person22 food)
   goals met: 19 of 36
73. (fly drone1 loc27 depot)
   deleted: (at-drone drone1 loc27)
   added: (at-drone drone1 depot)
   goals met: 20 of 36
74. (pickup-arm1 drone1 crate10 depot)
   deleted: (at-crate crate10 depot) (free-arm1 drone1) (available crate10)
   added: (carrying-arm1 drone1 crate10)
   goals met: 20 of 36
75. (fly drone1 depot loc20)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc20)
   goals met: 19 of 36
76. (deliver-arm2 drone1 crate31 person33 medicine loc20)
   deleted: (carrying-arm2 drone1 crate31)
   added: (free-arm2 drone1) (has person33 medicine)
   goals met: 20 of 36
77. (deliver-arm1 drone1 crate10 person13 food loc20)
   deleted: (carrying-arm1 drone1 crate10)
   added: (free-arm1 drone1) (has person13 food)
   goals met: 21 of 36
78. (fly drone1 loc20 depot)
   deleted: (at-drone drone1 loc20)
   added: (at-drone drone1 depot)
   goals met: 22 of 36
79. (pickup-arm2 drone1 crate30 depot)
   deleted: (at-crate crate30 depot) (free-arm2 drone1) (available crate30)
   added: (carrying-arm2 drone1 crate30)
   goals met: 22 of 36
80. (pickup-arm1 drone1 crate9 depot)
   deleted: (at-crate crate9 depot) (free-arm1 drone1) (available crate9)
   added: (carrying-arm1 drone1 crate9)
   goals met: 22 of 36
81. (fly drone1 depot loc18)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc18)
   goals met: 21 of 36
82. (deliver-arm2 drone1 crate30 person34 medicine loc18)
   deleted: (carrying-arm2 drone1 crate30)
   added: (free-arm2 drone1) (has person34 medicine)
   goals met: 22 of 36
83. (deliver-arm1 drone1 crate9 person34 food loc18)
   deleted: (carrying-arm1 drone1 crate9)
   added: (free-arm1 drone1) (has person34 food)
   goals met: 23 of 36
84. (fly drone1 loc18 depot)
   deleted: (at-drone drone1 loc18)
   added: (at-drone drone1 depot)
   goals met: 24 of 36
85. (pickup-arm2 drone1 crate29 depot)
   deleted: (at-crate crate29 depot) (free-arm2 drone1) (available crate29)
   added: (carrying-arm2 drone1 crate29)
   goals met: 24 of 36
86. (pickup-arm1 drone1 crate8 depot)
   deleted: (at-crate crate8 depot) (free-arm1 drone1) (available crate8)
   added: (carrying-arm1 drone1 crate8)
   goals met: 24 of 36
87. (fly drone1 depot loc13)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc13)
   goals met: 23 of 36
88. (deliver-arm2 drone1 crate29 person32 medicine loc13)
   deleted: (carrying-arm2 drone1 crate29)
   added: (free-arm2 drone1) (has person32 medicine)
   goals met: 24 of 36
89. (deliver-arm1 drone1 crate8 person17 food loc13)
   deleted: (carrying-arm1 drone1 crate8)
   added: (free-arm1 drone1) (has person17 food)
   goals met: 25 of 36
90. (fly drone1 loc13 depot)
   deleted: (at-drone drone1 loc13)
   added: (at-drone drone1 depot)
   goals met: 26 of 36
91. (pickup-arm2 drone1 crate28 depot)
   deleted: (at-crate crate28 depot) (free-arm2 drone1) (available crate28)
   added: (carrying-arm2 drone1 crate28)
   goals met: 26 of 36
92. (pickup-arm1 drone1 crate7 depot)
   deleted: (at-crate crate7 depot) (free-arm1 drone1) (available crate7)
   added: (carrying-arm1 drone1 crate7)
   goals met: 26 of 36
93. (fly drone1 depot loc9)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc9)
   goals met: 25 of 36
94. (deliver-arm2 drone1 crate28 person19 medicine loc9)
   deleted: (carrying-arm2 drone1 crate28)
   added: (free-arm2 drone1) (has person19 medicine)
   goals met: 26 of 36
95. (deliver-arm1 drone1 crate7 person19 food loc9)
   deleted: (carrying-arm1 drone1 crate7)
   added: (free-arm1 drone1) (has person19 food)
   goals met: 27 of 36
96. (fly drone1 loc9 depot)
   deleted: (at-drone drone1 loc9)
   added: (at-drone drone1 depot)
   goals met: 28 of 36
97. (pickup-arm2 drone1 crate27 depot)
   deleted: (at-crate crate27 depot) (free-arm2 drone1) (available crate27)
   added: (carrying-arm2 drone1 crate27)
   goals met: 28 of 36
98. (pickup-arm1 drone1 crate6 depot)
   deleted: (at-crate crate6 depot) (free-arm1 drone1) (available crate6)
   added: (carrying-arm1 drone1 crate6)
   goals met: 28 of 36
99. (fly drone1 depot loc6)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc6)
   goals met: 27 of 36
100. (deliver-arm2 drone1 crate27 person18 medicine loc6)
   deleted: (carrying-arm2 drone1 crate27)
   added: (free-arm2 drone1) (has person18 medicine)
   goals met: 28 of 36
101. (deliver-arm1 drone1 crate6 person18 food loc6)
   deleted: (carrying-arm1 drone1 crate6)
   added: (free-arm1 drone1) (has person18 food)
   goals met: 29 of 36
102. (fly drone1 loc6 depot)
   deleted: (at-drone drone1 loc6)
   added: (at-drone drone1 depot)
   goals met: 30 of 36
103. (pickup-arm2 drone1 crate26 depot)
   deleted: (at-crate crate26 depot) (free-arm2 drone1) (available crate26)
   added: (carrying-arm2 drone1 crate26)
   goals met: 30 of 36
104. (pickup-arm1 drone1 crate5 depot)
   deleted: (at-crate crate5 depot) (free-arm1 drone1) (available crate5)
   added: (carrying-arm1 drone1 crate5)
   goals met: 30 of 36
105. (fly drone1 depot loc5)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc5)
   goals met: 29 of 36
106. (deliver-arm2 drone1 crate26 person3 medicine loc5)
   deleted: (carrying-arm2 drone1 crate26)
   added: (free-arm2 drone1) (has person3 medicine)
   goals met: 30 of 36
107. (deliver-arm1 drone1 crate5 person3 food loc5)
   deleted: (carrying-arm1 drone1 crate5)
   added: (free-arm1 drone1) (has person3 food)
   goals met: 31 of 36
108. (fly drone1 loc5 depot)
   deleted: (at-drone drone1 loc5)
   added: (at-drone drone1 depot)
   goals met: 32 of 36
109. (pickup-arm2 drone1 crate4 depot)
   deleted: (at-crate crate4 depot) (free-arm2 drone1) (available crate4)
   added: (carrying-arm2 drone1 crate4)
   goals met: 32 of 36
110. (pickup-arm1 drone1 crate3 depot)
   deleted: (at-crate crate3 depot) (free-arm1 drone1) (available crate3)
   added: (carrying-arm1 drone1 crate3)
   goals met: 32 of 36
111. (fly drone1 depot loc1)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc1)
   goals met: 31 of 36
112. (deliver-arm2 drone1 crate4 person9 food loc1)
   deleted: (carrying-arm2 drone1 crate4)
   added: (free-arm2 drone1) (has person9 food)
   goals met: 32 of 36
113. (deliver-arm1 drone1 crate3 person24 food loc1)
   deleted: (carrying-arm1 drone1 crate3)
   added: (free-arm1 drone1) (has person24 food)
   goals met: 33 of 36
114. (fly drone1 loc1 depot)
   deleted: (at-drone drone1 loc1)
   added: (at-drone drone1 depot)
   goals met: 34 of 36
115. (pickup-arm2 drone1 crate2 depot)
   deleted: (at-crate crate2 depot) (free-arm2 drone1) (available crate2)
   added: (carrying-arm2 drone1 crate2)
   goals met: 34 of 36
116. (pickup-arm1 drone1 crate1 depot)
   deleted: (at-crate crate1 depot) (free-arm1 drone1) (available crate1)
   added: (carrying-arm1 drone1 crate1)
   goals met: 34 of 36
117. (fly drone1 depot loc1)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc1)
   goals met: 33 of 36
118. (deliver-arm2 drone1 crate2 person26 food loc1)
   deleted: (carrying-arm2 drone1 crate2)
   added: (free-arm2 drone1) (has person26 food)
   goals met: 34 of 36
119. (deliver-arm1 drone1 crate1 person27 food loc1)
   deleted: (carrying-arm1 drone1 crate1)
   added: (free-arm1 drone1) (has person27 food)
   goals met: 35 of 36
120. (fly drone1 loc1 depot)
   deleted: (at-drone drone1 loc1)
   added: (at-drone drone1 depot)
   goals met: 36 of 36
